Repository: AlfCano/rk.pivot.reshape
Catalog: inst/rkward/po/*.po
Languages: de, es, fr, pt_br

source: An RKWard plugin to reshape data by pivoting it longer or wider using functions from the 'tidyr' package.
de: Ein RKWard-Plugin zur Umformung von Daten durch Pivotieren in das Längs- oder Breitformat unter Verwendung von Funktionen aus dem 'tidyr'-Paket.
es: Un plugin de RKWard para reformar datos pivotando a lo largo o a lo ancho usando funciones del paquete 'tidyr'.
fr: Un plugin RKWard pour restructurer les données en pivotant vers un format plus long ou plus large à l'aide des fonctions du package 'tidyr'.
pt_br: Um plugin do RKWard para remodelar dados pivotando para o formato longo ou largo usando funções do pacote 'tidyr'.

source: Data (data.frame)
de: Daten (data.frame)
es: Datos (data.frame)
fr: Données (data.frame)
pt_br: Dados (data.frame)

source: Columns to pivot (cols)
de: Zu pivotierende Spalten (cols)
es: Columnas a pivotar (cols)
fr: Colonnes à pivoter (cols)
pt_br: Colunas para pivotar (cols)

source: Name for new key column (names_to)
de: Name für neue Schlüsselspalte (names_to)
es: Nombre para nueva columna clave (names_to)
fr: Nom pour la nouvelle colonne clé (names_to)
pt_br: Nome para nova coluna chave (names_to)

source: Name for new value column (values_to)
de: Name für neue Wertspalte (values_to)
es: Nombre para nueva columna valor (values_to)
fr: Nom pour la nouvelle colonne valeur (values_to)
pt_br: Nome para nova coluna valor (values_to)

source: Handle duplicate column names (names_repair)
de: Doppelte Spaltennamen behandeln (names_repair)
es: Manejar nombres de columna duplicados (names_repair)
fr: Gérer les noms de colonnes dupliqués (names_repair)
pt_br: Tratar nomes de colunas duplicados (names_repair)

source: Check for unique names (default)
de: Auf eindeutige Namen prüfen (Standard)
es: Verificar nombres únicos (predeterminado)
fr: Vérifier les noms uniques (défaut)
pt_br: Verificar nomes únicos (padrão)

source: Minimal
es: Mínimo
pt_br: Mínimo

source: Make unique
de: Eindeutig machen
es: Hacer únicos
fr: Rendre unique
pt_br: Tornar único

source: Make universal
de: Universal machen
es: Hacer universales
fr: Rendre universel
pt_br: Tornar universal

source: Drop rows with NA values (values_drop_na)
de: Zeilen mit NA-Werten verwerfen (values_drop_na)
es: Eliminar filas con valores NA (values_drop_na)
fr: Supprimer les lignes avec des valeurs NA (values_drop_na)
pt_br: Descartar linhas com valores NA (values_drop_na)

source: Save longer data to
de: Langes Format speichern in
es: Guardar datos largos en
fr: Enregistrer les données 'longues' sous
pt_br: Salvar dados longos em

source: Pivot Data from Wide to Long
de: Daten von Breit nach Lang pivotieren
es: Transformar datos de Ancho a Largo
fr: Transformer les données de Large vers Long
pt_br: Transformar dados de Largo para Longo

source: Lengthens data by converting multiple columns into two: a 'key' column and a 'value' column.
de: Verlängert Daten durch Umwandlung mehrerer Spalten in zwei: eine 'Schlüssel'-Spalte und eine 'Wert'-Spalte.
es: Alarga los datos convirtiendo múltiples columnas en dos: una columna 'clave' y una columna 'valor'.
fr: Allonge les données en convertissant plusieurs colonnes en deux : une colonne 'clé' et une colonne 'valeur'.
pt_br: Alonga os dados convertendo múltiplas colunas em duas: uma coluna 'chave' e uma coluna 'valor'.

source: Pivot Longer
de: Länger pivotieren
es: Pivotar a Largo
fr: Pivoter vers Long
pt_br: Pivotar para Longo

source: Select a data frame and at least two columns you wish to pivot into a longer format. The result is saved to a new R object.
de: Wählen Sie einen Data Frame und mindestens zwei Spalten, die Sie in ein längeres Format pivotieren möchten. Das Ergebnis wird in einem neuen R-Objekt gespeichert.
es: Seleccione un data frame y al menos dos columnas que desee pivotar a un formato más largo. El resultado se guarda en un nuevo objeto R.
fr: Sélectionnez un data frame et au moins deux colonnes que vous souhaitez pivoter vers un format plus long. Le résultat est enregistré dans un nouvel objet R.
pt_br: Selecione um data frame e pelo menos duas colunas que deseja pivotar para um formato mais longo. O resultado é salvo em um novo objeto R.

source: Options
de: Optionen
es: Opciones
pt_br: Opções

source: <p><b>Columns to pivot (cols):</b> Select two or more columns that will be gathered into the new key/value pair columns.</p><p><b>Name for new key column (names_to):</b> The name for the new column that will contain what were previously column headers.</p><p><b>Name for new value column (values_to):</b> The name for the new column that will contain the values previously spread across the selected pivot columns.</p>
de: <p><b>Zu pivotierende Spalten (cols):</b> Wählen Sie zwei oder mehr Spalten aus, die in den neuen Schlüssel/Wert-Paar-Spalten zusammengefasst werden.</p><p><b>Name für neue Schlüsselspalte (names_to):</b> Der Name für die neue Spalte, die die ehemaligen Spaltenüberschriften enthalten wird.</p><p><b>Name für neue Wertspalte (values_to):</b> Der Name für die neue Spalte, die die Werte enthalten wird, die zuvor über die ausgewählten Pivot-Spalten verteilt waren.</p>
es: <p><b>Columnas a pivotar (cols):</b> Seleccione dos o más columnas que se agruparán en las nuevas columnas de par clave/valor.</p><p><b>Nombre para nueva columna clave (names_to):</b> El nombre de la nueva columna que contendrá lo que antes eran encabezados de columna.</p><p><b>Nombre para nueva columna valor (values_to):</b> El nombre de la nueva columna que contendrá los valores previamente dispersos en las columnas seleccionadas.</p>
fr: <p><b>Colonnes à pivoter (cols) :</b> Sélectionnez deux colonnes ou plus qui seront rassemblées dans les nouvelles colonnes paire clé/valeur.</p><p><b>Nom pour la nouvelle colonne clé (names_to) :</b> Le nom de la nouvelle colonne qui contiendra ce qui était auparavant des en-têtes de colonnes.</p><p><b>Nom pour la nouvelle colonne valeur (values_to) :</b> Le nom de la nouvelle colonne qui contiendra les valeurs précédemment réparties dans les colonnes pivot sélectionnées.</p>
pt_br: <p><b>Colunas para pivotar (cols):</b> Selecione duas ou mais colunas que serão reunidas nas novas colunas de par chave/valor.</p><p><b>Nome para nova coluna chave (names_to):</b> O nome da nova coluna que conterá o que antes eram cabeçalhos de coluna.</p><p><b>Nome para nova coluna valor (values_to):</b> O nome da nova coluna que conterá os valores anteriormente espalhados pelas colunas de pivô selecionadas.</p>

source: Pivot Longer results saved to object:
de: Pivot Longer Ergebnisse in Objekt gespeichert:
es: Resultados de Pivotar a Largo guardados en objeto:
fr: Résultats Pivot Longer enregistrés dans l'objet :
pt_br: Resultados do Pivotar para Longo salvos no objeto:

source: Column(s) for cell values (values_from)
de: Spalte(n) für Zellenwerte (values_from)
es: Columna(s) para valores de celda (values_from)
fr: Colonne(s) pour les valeurs des cellules (values_from)
pt_br: Coluna(s) para valores das células (values_from)

source: ID columns (id_cols, optional)
de: ID-Spalten (id_cols, optional)
es: Columnas ID (id_cols, opcional)
fr: Colonnes ID (id_cols, optionnel)
pt_br: Colunas de ID (id_cols, opcional)

source: Handle duplicate column names
de: Doppelte Spaltennamen behandeln
es: Manejar nombres de columna duplicados
fr: Gérer les noms de colonnes dupliqués
pt_br: Tratar nomes de colunas duplicados

source: Column for new column names (names_from)
de: Spalte für neue Spaltennamen (names_from)
es: Columna para nuevos nombres de columna (names_from)
fr: Colonne pour les nouveaux noms de colonnes (names_from)
pt_br: Coluna para novos nomes de coluna (names_from)

source: Generate Sequence/Index Column (Handles duplicates)
de: Sequenz-/Indexspalte generieren (Behandelt Duplikate)
es: Generar Columna de Secuencia/Índice (Maneja duplicados)
fr: Générer une colonne de séquence/index (Gère les doublons)
pt_br: Gerar Coluna de Sequência/Índice (Lida com duplicatas)

source: Name for new sequence variable
de: Name für neue Sequenzvariable
es: Nombre para nueva variable de secuencia
fr: Nom de la nouvelle variable de séquence
pt_br: Nome para nova variável de sequência

source: Group sequence by (usually ID)
de: Sequenz gruppieren nach (normalerweise ID)
es: Agrupar secuencia por (usualmente ID)
fr: Grouper la séquence par (généralement ID)
pt_br: Agrupar sequência por (geralmente ID)

source: Include index variable in output (values_from)
de: Indexvariable in die Ausgabe aufnehmen (values_from)
es: Incluir variable de índice en la salida (values_from)
fr: Inclure la variable d'index dans la sortie (values_from)
pt_br: Incluir variável de índice na saída (values_from)

source: Automatic Sequence Generation
de: Automatische Sequenzgenerierung
es: Generación Automática de Secuencia
fr: Génération automatique de séquence
pt_br: Geração Automática de Sequência

source: Save wider data to
de: Breites Format speichern in
es: Guardar datos anchos en
fr: Enregistrer les données 'larges' sous
pt_br: Salvar dados largos em

source: Data & Values
de: Daten & Werte
es: Datos y Valores
fr: Données & Valeurs
pt_br: Dados & Valores

source: Column Naming
de: Spaltenbenennung
es: Nombres de Columna
fr: Nommage des Colonnes
pt_br: Nomeação de Colunas

source: Output
de: Ausgabe
es: Salida
fr: Sortie
pt_br: Saída

source: Pivot Data from Long to Wide
de: Daten von Lang nach Breit pivotieren
es: Transformar datos de Largo a Ancho
fr: Transformer les données de Long vers Large
pt_br: Transformar dados de Longo para Largo

source: Widens data by converting a key/value pair of columns into multiple columns.
de: Verbreitert Daten durch Umwandlung eines Schlüssel/Wert-Spaltenpaares in mehrere Spalten.
es: Ensancha los datos convirtiendo un par de columnas clave/valor en múltiples columnas.
fr: Élargit les données en convertissant une paire de colonnes clé/valeur en plusieurs colonnes.
pt_br: Alarga os dados convertendo um par de colunas chave/valor em múltiplas colunas.

source: Pivot Wider
de: Breiter pivotieren
es: Pivotar a Ancho
fr: Pivoter vers Large
pt_br: Pivotar para Largo

source: Sequence Generation
de: Sequenzgenerierung
es: Generación de Secuencia
fr: Génération de Séquence
pt_br: Geração de Sequência

source: <p>If your long data has multiple rows for the same ID (e.g., a teacher has 3 classes), you can check 'Generate Sequence/Index Column'. This creates a new variable (e.g., 'repet') counting 1, 2, 3... for each ID, and uses this as the column header (names_from).</p>
de: <p>Wenn Ihre langen Daten mehrere Zeilen für dieselbe ID haben (z. B. ein Lehrer hat 3 Klassen), können Sie 'Sequenz-/Indexspalte generieren' aktivieren. Dies erstellt eine neue Variable (z. B. 'repet'), die 1, 2, 3... für jede ID zählt, und verwendet diese als Spaltenüberschrift (names_from).</p>
es: <p>Si sus datos largos tienen múltiples filas para el mismo ID (ej. un profesor tiene 3 clases), puede marcar 'Generar Columna de Secuencia/Índice'. Esto crea una nueva variable (ej. 'repet') contando 1, 2, 3... para cada ID, y usa esto como encabezado de columna (names_from).</p>
fr: <p>Si vos données longues ont plusieurs lignes pour le même ID (par ex., un enseignant a 3 classes), vous pouvez cocher 'Générer une colonne de séquence/index'. Cela crée une nouvelle variable (par ex. 'repet') comptant 1, 2, 3... pour chaque ID, et l'utilise comme en-tête de colonne (names_from).</p>
pt_br: <p>Se seus dados longos tiverem múltiplas linhas para o mesmo ID (ex: um professor tem 3 turmas), você pode marcar 'Gerar Coluna de Sequência/Índice'. Isso cria uma nova variável (ex: 'repet') contando 1, 2, 3... para cada ID, e usa isso como o cabeçalho da coluna (names_from).</p>

source: Pivot Data (Wider)
de: Daten pivotieren (Breiter)
es: Pivotar Datos (Ancho)
fr: Pivoter les données (Large)
pt_br: Pivotar Dados (Largo)

source: Result saved in:
de: Ergebnis gespeichert in:
es: Resultado guardado en:
fr: Résultat enregistré sous :
pt_br: Resultado salvo em:
